src/cf/Catalogs/ItobГеографическиеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ItobГеографическиеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правообладатель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СайтПравообладателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Атрибуты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлойПодложки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ItobГеографическиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СекцияHEAD</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НестандартнаяПроекция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ItobГеографическиеКарты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Сортировка = 100;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПустаяСтрока(Объект.Идентификатор) Тогда
		ItobРаботаС_БСП_КлиентСервер.СообщитьПользователю(
						НСтр("ru = 'Не указан идентификатор!'; en = 'No identifier specified!'"), ,
						"Объект.Идентификатор", ,
						Отказ);
		Возврат;				
						
	ИначеЕсли Найти(Объект.Идентификатор," ")>0 
			ИЛИ Найти(Объект.Идентификатор,"\")>0
			ИЛИ Найти(Объект.Идентификатор,"/")>0 Тогда
		ItobРаботаС_БСП_КлиентСервер.СообщитьПользователю(
						НСтр("ru = 'Неверный идентификатор!'; en = 'Invalid identifier!'"), ,
						"Объект.Идентификатор", ,
						Отказ);					
	    Возврат;
		
	КонецЕсли;                          
	
	Если НЕ Объект.СлойПодложки.Пустая()
		 И Объект.СлойПодложки = Объект.Ссылка Тогда		
		 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Недопустимая настройка: указана подложка, совпадающая с самой географической картой",,,
														  "Объект.СлойПодложки",
														  Отказ);
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти
